{
  "timestamp": "2025-06-05T15:41:47.694439",
  "name": "Luna at Gavilan Ridge",
  "status": null,
  "url": "https://www.delwebb.com/homes/california/orange-county/rancho-mission-viejo/luna-at-gavilan-ridge-211498",
  "price_from": "$1",
  "address": "Corkscrew Road and Hawk Street, Rancho Mission Viejo, California 92694",
  "phone": "(949) 652-3700",
  "description": "ABOUT THE HOME ENERGY RATING SCALE\nThe HERS (Home Energy Rating System) Index allows buyers to compare the relative energy efficiency of different homes. The HERS Index home energy rating is determined by an independent RESNET-certified home energy rater (\"Rater\"). The lower a home&rsquo;s score, the more energy efficient it is in comparison to the HERS referenced home. For every one-point decrease in the HERS Index score, there is a corresponding one percent (1%) reduction in energy consumption as compared to a home with a HERS Index of 100. A home with a HERS score of 100 reflects a home built to 2006 IEEC Building Codes. See the bottom of this page for more information on HERS scores.",
  "images": [
    "https://res.cloudinary.com/dv0jqjrc3/image/fetch/ar_1.5,c_fill,f_auto,q_auto,w_768/https://pultegroup.cdn.picturepark.com/v/gG2sROro/",
    "https://res.cloudinary.com/dv0jqjrc3/image/fetch/ar_1.5,c_fill,f_auto,q_auto,w_768/https://pultegroup.cdn.picturepark.com/v/lPagIlUh/"
  ],
  "location": {
    "latitude": 33.52939291046817,
    "longitude": -117.57809216163992,
    "address": {
      "city": null,
      "state": null,
      "market": null
    }
  },
  "details": {
    "price_range": null,
    "sqft_range": null,
    "bed_range": null,
    "bath_range": null,
    "stories_range": null,
    "community_count": null
  },
  "amenities": [
    {
      "name": "Perch Rienda",
      "description": "The Perch at Rienda (55+ Exclusive): Lap pool with cabanas, spa, indoor/outdoor lounge and dining/entertaining spaces, fire pit.",
      "icon_url": null
    },
    {
      "name": "Outlook Esencia",
      "description": "The Outlook at Esencia (55+ Exclusive): Lap pool, spa, indoor/outdoor lounge area.",
      "icon_url": null
    },
    {
      "name": "Getaway Esencia",
      "description": "The Getaway at Esencia (55+ Exclusive): Indoor lounge with lending library, BBQ/outdoor kitchen, water feature/lawn area.",
      "icon_url": null
    },
    {
      "name": "BBQ Barn",
      "description": "The BBQ Barn at Esencia (55+ Exclusive): Outdoor kitchen with BBQs and dining / entertaining spaces, bocce ball courts.",
      "icon_url": null
    },
    {
      "name": "Hacienda Sendero",
      "description": "The Hacienda at Sendero (55+ Exclusive): Palomino Bar and great room, pool with cabanas, spa, indoor fitness, movement studio, fire pits/BBQs, bocce ball courts, locker rooms with showers, massage room, lending library.",
      "icon_url": null
    },
    {
      "name": "Canyon House",
      "description": "The Canyon House & Canyon Coffee: A social hub featuring, an open-air courtyard overlooking Oak Canyon, multiple loggias, meeting and event rooms, a catering kitchen, and a large activity lawn. Canyon Coffee by Blue Hummingbird features specialty coffee, teas and refreshments.",
      "icon_url": null
    },
    {
      "name": "RMV Farms:",
      "description": "RMV Farms: With rows of crops, planter beds, a chicken coop, greenhouse, and a courtyard for garden and culinary workshops, Esencia Farm, Sendero Farm and Gavilán Farm offer a unique farm-to-table experience right in your back yard.",
      "icon_url": null
    },
    {
      "name": "Ranch Camp:",
      "description": "Ranch Camp: A unique collection of recreational amenities including a 4 lane lap pool, fitness center, the Ranch Cove 20,000 sq. ft lagoon style pool, event lawn, picnic and BBQ area.",
      "icon_url": null
    },
    {
      "name": "Sendero Field:",
      "description": "Sendero Field: With lots of open space, enjoy baseball fi elds, four pickleball courts, a picnic pavilion, grassy areas and a nature inspired adventure playground.",
      "icon_url": null
    },
    {
      "name": "Oak Canyon:",
      "description": "Oak Canyon: An oak-filled preserved canyon with scenic lookouts and multi-use hiking trails that lead to The Canyon House.",
      "icon_url": null
    },
    {
      "name": "Hangout: This",
      "description": "The Hangout: This communal gathering spot features tables and chairs, a food prep area, BBQs and fire pits, and a custom fountain that is covered by the “chandelier trees,” illuminated at night.",
      "icon_url": null
    },
    {
      "name": "Boulder Pond",
      "description": "Boulder Pond & Playground: A recreational outdoor community amenity offering a variety of resident experiences including a half-mile of walking paths, 3.5 acre pond, and playground for children of all ages.",
      "icon_url": null
    },
    {
      "name": "Sendero Marketplace:",
      "description": "Sendero Marketplace: A lifestyle retail destination with a wide range of offerings including dining, shopping, and more.",
      "icon_url": null
    },
    {
      "name": "Providence Mission",
      "description": "Providence Mission Hospital Sports Park & North Plunge: A state-of the-art, multi-use park with softball and baseball diamonds, synthetic turf soccer fi eld and batting cages. The North Plunge includes tennis/pickleball courts, a swimming pool, along with a BBQ and fire pit for enjoyment all year long.",
      "icon_url": null
    },
    {
      "name": "Hilltop: community",
      "description": "The Hilltop: A community recreational centerpiece with fitness and group spaces, swimming pool, spa and wader, event staffed bar, arcade, fire pits, catering kitchen with private patio, BBQ pavilion, and a large event lawn.",
      "icon_url": null
    },
    {
      "name": "Rienda Plunge:",
      "description": "Rienda Plunge: A recreational destination at Rienda featuring a pool, spa, event room, BBQ, patio and tot lot for year-round entertaining and gatherings.",
      "icon_url": null
    },
    {
      "name": "Ranch House",
      "description": "Ranch House & Guest House: The Ranch House and The Guest House offer something for everyone, including a large indoor entertaining space with catering kitchen, event room complete with an outdoor patio, lawn and BBQ, fitness center, lap pool, splash pad, and more!",
      "icon_url": null
    },
    {
      "name": "South Paw",
      "description": "South Paw Dog Park: The perfect retreat for a furry friend. A dog park complete with dog watering and washing stations.",
      "icon_url": null
    },
    {
      "name": "Backyard: Expansive",
      "description": "The Backyard: Expansive park with an eclectic mix of play features for little ones to let loose on larger-than-life playground equipment. There is a ½ mile trail and BBQ and picnic pavilions.",
      "icon_url": null
    },
    {
      "name": "Pavilion: Gymnasium,",
      "description": "The Pavilion: Gymnasium, tot lot, outdoor gathering, picnic structure with BBQ, and open play area with soccer field and softball backstop.",
      "icon_url": null
    }
  ],
  "homeplans": [],
  "homesites": [],
  "nearbyplaces": [],
  "collections": []
}